Revit 2024 API
UnitUtils.GetAllDisciplines Method
 Gets the identifiers of all available disciplines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static IList<ForgeTypeId> GetAllDisciplines()
Visual Basic
Public Shared Function GetAllDisciplines As IList(Of ForgeTypeId)
Visual C++
public:
static IList<ForgeTypeId^>^ GetAllDisciplines()
Return Value
 The discipline identifiers.
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace